##print("Привет меня зовут Калькулятор Коля, мне WEEK 10 минут и я умею складывать два числа !!")
##b=int(input('Введите число от 1 до 10000000000000: ')) #ввод
##A=int(input('Введите число от 1 до 1000000000000000000000000000000: '))  #ввод
##print('Сумма')
##print(b+A)Разность ' + str(b-A) )
##print('Частное ' + str(b/A) )
##print('Деление нацело ' + str(b//A) )
##print('Произведение ' + str(b*A) )
##
##F=input('Введите своё имя: ')
##G=input('Введите свой возраст: ')
##print( 'Привет меня зовут ' + F + ' мне ' + G )
##
##a=int(input('Введите число ') )
##l=a-1
##f=a+1
##print('Число предшествующее числу ' + str(a) + ' равно ' + str(l) )
##print('Число следущее за числом ' + str(a) + ' равно ' + str(f) )
##
##x=int(input('Введите число ') )
##print(x**2-10*x+15)

##from math import sqrt
##g=int(input('Введите число ') )
##h=int(input('Введите число ') )
##c=sqrt(g**2+h**2)
##print(c)
##P=(g+h+c)
##print(P)

##a=int(input('Введите число ') )
##b=int(input('Введите число ') )
##print('a>b: ' +str(a>b))
##print(f'a<b: {a<b}')
###print(f'a<=b: {a<=b}')
##print(f'a>=b: {a>=b}')
##print(f'a==b: {a==b}')
##print(f'a!=b: {a!=b}')

##a=int(input('Введите число ') )
##print(a%2==0)
##
##a=int(input('Введите число ') )
##print(a>0)
##a=int(input('Введите длину ') )
##b=int(input('Введите ширину ') )
##p=( (a+b)*2)
##s=(a*b)
##print(f'Периметр {p}')
##print(f'Площадь {s}')

##a=int(input('Введите число ') )
##b=int(input('Введите число ') )
##c=int(input('Введите число ') )
##print(f'a==b and b==c: {a==b and b==c}')

a=int(input('Введите число ') )
b=int(input('Введите число ') )
c=int(input('Введите число ') )
print(f'a>0 or b>0 or c>0: {a>0 or b>0 or c>
a=int(input('Введите число ') )
b=int(input('Введите число ') )
c=int(input('Введите число ') )
print(f'a<0 or b<0 or c<0: {a<0 or b<0 or c<0}')\
##
##a=int(input('Введите число ') )
##b=int(input('Введите число ') )
##c=int(input('Введите число ') )
##print(f'a<0 and b<0 and c<0: {a<0 and b<0 and c<0}')\
##            
##a=int(input('Введите число ') )
##b=int(input('Введите число ') )
##print(a%2==0)
##print(b%2==0)
##A=(a%2==0)
##B=(b%2==0)
##print(f'A==B  : {A==B }')

##a=int(input('Введите число oт 60 до 10000000000000000000000000000000000000000000000000 ') )
##s=(a//60)
##print(s)

##a=int(input('Введите число  ') )
##s=(a//60)
##d=(a//3600)
##print('Часы ' +str (d) + ' Минуты ' +str (s) + ' Секунды ' +str(a) )
##
##a=int(input('Введите число  ') )

##a=int(input('Введите число  ') )
##b=int(input('Введите число  ') )
##if a>b:
## print(a)
##else: 
## print(b)
##
a=int(input('Введите число  ') )
b=int(input('Введите число  ') )
if a<b:
 print(a)
else: 
 print(b)

##a=int(input('Введите градусы  ') )
##if a>0:
## print('теплооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооо')
##else: 
## print('холоднооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооооо')
